app/Controllers/Kehadiran.php

SELECT *
FROM `kehadiran`
LEFT JOIN `user` ON `user`.`id_user` = `kehadiran`.`id_user`
LEFT JOIN `matkul` ON `matkul`.`id_matkul` = `kehadiran`.`id_matkul`
WHERE `kehadiran`.`id_user` = '4'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kehadiran`
LEFT JOIN `user` ON `user`.`id_user` = `kehadiran`.`id_user`
LEFT JOIN `matkul` ON `matkul`.`id_matkul` = `kehadiran`.`id_matkul`
WHERE `kehadiran`.`id_user` = '4'
---
    public function index()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }

        $dosen = $this->kehadiran->join('user', 'user.id_user = kehadiran.id_user', 'left')
            ->join('matkul', 'matkul.id_matkul = kehadiran.id_matkul', 'left');
        if (session()->get('hak_akses') == 2) {
            $dosen->where('kehadiran.id_user', session()->id_user);
        }
        $data = [
            'data' => $dosen->paginate('5', 'kehadiran'),
            'title' => 'Data Kehadiran',
            'pager' => $this->kehadiran->pager,
        ];

SELECT *
FROM `user`
SELECT *
FROM `matkul`
WHERE `id_user` = '4'
---
    public function tambah()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }

        $id_user = session()->get('id_user');
        $data = [
            'title' => 'Kehadiran',
            'user' => $this->user->findAll(),
            'matkul' => $this->matkul->where('id_user', $id_user)->findAll()
        ];

INSERT INTO `kehadiran` (`tgl_hadir`, `id_matkul`, `absensi`, `catatan`, `id_user`) VALUES ('2024-07-13', '7', 'Tidak Hadir', 'Kerjakan tugas pada ppt yang sudah diberikan pada pertemuan sebelumnya. Kirim ke WA', '4')
---
    public function save()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }

        $data = $this->request->getPost();
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $data['id_user'] = session()->get('id_user');

        $this->kehadiran->save($data);