app/Controllers/Login.php

    public function process()
    {
        $user = new UserModel();
        $username = $this->request->getVar('username');
        $password = ($this->request->getVar('password'));
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];
        if (!$this->validateData($this->request->getPost(), $rules)) {
            return redirect()->back()->with('error', $this->validator->getErrors());
        }
        $dataUser = $user->where([
            'username' => $username,
        ])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Alex'
 LIMIT 1