app/Controllers/Matkul.php

    public function index()
    {
        // if (!session()->get('username')) {
        //     return redirect()->route('Login::index');
        // }
        $dosen = $this->matkul->join('user', 'user.id_user = matkul.id_user');
        if (session()->get('hak_akses') == 2) {
            $dosen->where('matkul.id_user', session()->id_user);
        }
        $data = [
            'data' => $dosen->paginate('5', 'matkul'),
            'title' => 'Data Mata Kuliah',
            'pager' => $this->matkul->pager,
        ];
---
SELECT *
FROM `user`
SELECT *
FROM `matkul`
JOIN `user` ON `user`.`id_user` = `matkul`.`id_user`
WHERE `matkul`.`id_user` = '4'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `matkul`
JOIN `user` ON `user`.`id_user` = `matkul`.`id_user`
WHERE `matkul`.`id_user` = '4'

    public function tambah()
    {

        $data = [
            'title' => 'Tambah Data Mata Kuliah',
            'user' => $this->user->where('hak_akses', 2)->findAll()
---
SELECT *
FROM `user`
WHERE `hak_akses` = 2

    public function save()
    {
        $data = $this->request->getPost();
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->matkul->save($data);
---
INSERT INTO `matkul` (`nama_matkul`, `sks`, `semester`, `id_user`) VALUES ('Pancasila', '2', '1', '2')